# ChangeType Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ChangeType Class
Members See Also
---
A class representing a change that can be detected and tracked during Dynamic Update.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public class ChangeType : IDisposable
```

Visual Basic
---
```text
Public Class ChangeType _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ChangeType : IDisposable
```

# Remarks
ChangeTypes for specific changes can be obtained from the static methods available on Element.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ChangeType
# See Also
ChangeType Members
Autodesk.Revit.DB Namespace